Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs.GetModels
gets CloudModel values within Event.
Since:
2019

Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs.SetModels(System.Collections.Generic.IList{Autodesk.Revit.DB.ForgeDM.CloudModel})
Sets CloudModel values within Event.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs.GetFolders
gets CloudFolder values within Event.
Since:
2019

Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs.SetFolders(System.Collections.Generic.IList{Autodesk.Revit.DB.ForgeDM.CloudFolder})
Sets CloudFolder values within Event.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs.FolderId
Identifier for Folder in CloudProject
Since:
2019

Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs.ProjectId
Identifier for CloudProject
Since:
2019

Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs.HubId
Identifier for CloudHub
Since:
2019

Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs.#ctor(System.String,System.String,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Events.GetFolderContentsRequestedEventArgs
Event arguments used by the ForgeDM FolderContents event.
Represents Identifier of current Hub.
Represents Identifier of current Project.
Represents Identifier of current Folder in current Project.
Sets CloudFolder values within Event.
Gets CloudFolder values within Event.
Sets CloudModel values within Event.
Gets CloudModel values within Event.
Since:
2019